// 1 Запросіть у користувача його ім’я та виведіть у відповідь

// let name = prompt("Введіть ім'я");
// alert(`Привіт, ${name}`);


// 2 Запросіть у користувача його рік народження, підрахуйте

// const currentYear = 2025;
// let urAge = prompt('Введіть ваш рік народження');
// let count = currentYear - urAge;
// alert(`вам ${count} років`);


// 3 Запросіть у користувача довжину сторони квадрата 

// let side = prompt('Введіть довжину сторони квадрата');
// let perimeter = 4 * side;
// alert(`Периметр квадрата: ${perimeter} см`)


// 4 Запросіть у користувача радіус кола та виведіть його пло-
// щу.

// let radius = prompt("Введіть радіус кола (у см):");
// let area = Math.PI * radius ** 2;
// alert(`Площа кола: ${area.toFixed(2)} см²`);


// 5 Запросіть у користувача відстань у кілометрах між двома
// містами та за скільки годин він хоче дістатися.

// let distance = prompt("Введіть відстань між містами (у км):");
// let hours = prompt("За скільки годин хочете дістатися?");
// let speed = distance / hours;
// alert(`Вам потрібно рухатися зі швидкістю ${speed.toFixed(2)} км/год`); 



// 6 Реалізуйте конвертор валют. 
const usdToEur= 0.86 ; 
let usd = prompt("Введіть суму в доларах (USD):");
let eur = usd * usdToEur;
alert(`${usd} USD = ${eur.toFixed(2)} EUR`);
